app/Http/Controllers/Home/DetailController.php

select * from `article`
---
    public function index()
    {
        //获取Article的数据
		$list = Article::get();

select * from `contents` where `id` = '185' and `contents`.`id` = '185' limit 1
---
    public function edit($id)
    {

        //return $id;
        //获取要修改的单条信息
        $list = Contents::where('id',$id)->find($id); //获取信息

update `contents` set `title` = '放假回家', `author` = '合法化局', `content` = '发一份结果看高科技' where `id` = '185'
update `article` set `title` = '放假回家', `author` = '合法化局' where `cid` = '185'
---
    public function update(Request $request,$id)
    {
        //dump( $id) ;die;
        //获取修改的信息
        $input = $request->only('title','author','content');
        //$data =new Contents;
        $data =Contents::where('id',$id)->update($input);

        $info = $request->only('title','author');
        $content = Article::where('cid',$id)->update($info);

select * from `article` where `article`.`id` = '58)' limit 1
delete from `article` where `id` = '58'
---
    public function destroy($id)
    {
        //
        $del = Article::find($id);
        $del->delete($id);