app/Http/Controllers/Home/DiscusstabController.php

    public function show($id)
	{
		$art = Article::where("userid","=",$id)->get();
---
select * from `article` where `userid` = '1'