app/Http/Controllers/Home/DiscusstabController.php

select * from `article`
---
    public function index()
    {
        //
		$art = Article::get();

insert into `discusstab` (`content`, `articleid`, `disTime`, `status`) values ('sdfsfss', '荣亚宁', '', '1')
---
    public function store(Request $request)
    {
        $db = new Discusstab;
       //获取要添加的数据
        $data = $request->only("content","articleid","disTime");
        $data["status"]=1;
		//$date["disTime"]= 'Y-m-d H:i:s';
		 //$data('Y-m-d H:i:s',["disTime"]=time);
		//print_r(data);
        //print_r($date);die;
        //执行添加
        $id = $db->insertGetId($data);