app/Http/Controllers/Home/IndexController.php

select * from `article`
---
    public function index()
    {

        $art = Article::get();