app/Http/Controllers/Home/ListController.php

select * from `article`
---
    public function index()
    {
        //
		$list = Article::all();