app/Http/Controllers/Admin/ArticleController.php

select * from `Article` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `Article`
---
    public function index()
    {
        //
        $db = \DB::table("Article");

       //判断并封装搜索条件
       $params = array();
       if(!empty($_GET['author'])){
           $db->where("author","like","%{$_GET['author']}%");
           $params['author'] = $_GET['author']; //维持搜索条件
       }

       // $list = $db->get(); //获取全部
       $list = $db->orderBy("id",'desc')->paginate(5); //5条每页浏览

select * from `contents` where `id` = '156' and `contents`.`id` = '156' limit 1
---
    public function edit($id)
    {
        //
        $list = Contents::where('id',$id)->find($id); //获取信息

select * from `article` where `cid` = '30'
update `article` set `status` = '0' where `cid` = '30'
---
    public function update(Request $request, $id)
    {
        //return $id;die;
          $data = Article::where('cid',$id)->get(); //获取信息
          //获取状态
          $data = $request->only("status");
          //dd($data);  die;
          //$data = $request->status;
          //echo json_encode($data);die;
          $article = new Article;
          $article->where("cid",$id)->update($data);