app/Http/Controllers/Admin/CollectionController.php

    public function index()
    {
        //
		$db = \DB::table("collection");
       //判断并封装搜索条件
       $params = array();
       if(!empty($_GET['userid'])){
           $db->where("userid","like","%{$_GET['userid']}%");
           $params['userid'] = $_GET['userid']; //维持搜索条件
       }
       // $list = $db->get(); //获取全部
       $list = $db->orderBy("id",'desc')->paginate(5); //5条每页浏览
---
select * from `collection` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `collection`