app/Http/Controllers/Admin/DiscussTabController.php

    public function destroy($id)
    {
	    discusstab::where('id',$id)->delete();
---
delete from `discusstab` where `id` = '21'